import { KradColorType } from "../types/kradColor.type";

export const COLORS_RAL: KradColorType[] = [
  {
    "id": "_9016_",
    "name": "RAL 9016",
    "hex": "#F6F6F6",
    "title": "Транспортный белый",
    "rate": 1
  },
  {
    "id": "_9005_",
    "name": "RAL 9005",
    "hex": "#0A0A0A",
    "title": "Глубокий черный",
    "rate": 1.1
  },
  {
    "id": "_9005M_",
    "name": "RAL 9005 M",
    "hex": "#0A0A0A",
    "title": "Глубокий черный матовый",
    "rate": 1.1
  },
  {
    "id": "_7016_",
    "name": "RAL 7016",
    "hex": "#373F43",
    "title": "Антрацитово-серый",
    "rate": 1.1
  },
  {
    "id": "_7016M_",
    "name": "RAL 7016 M",
    "hex": "#373F43",
    "title": "Антрацитово-серый матовый",
    "rate": 1.1
  },
  {
    "id": "_7024_",
    "name": "RAL 7024",
    "hex": "#474A50",
    "title": "Графитовый серый",
    "rate": 1.1
  },
  {
    "id": "_7024M_",
    "name": "RAL 7024 M",
    "hex": "#474A50",
    "title": "Графитовый серый матовый",
    "rate": 1.1
  },
  {
    "id": "_9007_",
    "name": "RAL 9007",
    "hex": "#8F8F8F",
    "title": "Серо-алюминиевый",
    "rate": 1.1
  },
  {
    "id": "_7038_",
    "name": "RAL 7038",
    "hex": "#B4B8B0",
    "title": "Агатовый серый",
    "rate": 1.1
  },
  {
    "id": "_7044_",
    "name": "RAL 7044",
    "hex": "#BDBDB2",
    "title": "Серый шелк",
    "rate": 1.1
  },
  {
    "id": "_9016M_",
    "name": "RAL 9016 M",
    "hex": "#F6F6F6",
    "title": "Транспортный белый матовый",
    "rate": 1.1
  },
  {
    "id": "_9003_",
    "name": "RAL 9003",
    "hex": "#F4F4F4",
    "title": "Сигнальный белый",
    "rate": 1.1
  },
  {
    "id": "_9010_",
    "name": "RAL 9010",
    "hex": "#FFFFFF",
    "title": "Белый",
    "rate": 1.1
  },
  {
    "id": "_9001_",
    "name": "RAL 9001",
    "hex": "#FDF4E3",
    "title": "Кремово-белый",
    "rate": 1.1
  },
  {
    "id": "_1013_",
    "name": "RAL 1013",
    "hex": "#E9E5CE",
    "title": "Жемчужно-белый",
    "rate": 1.1
  },
  {
    "id": "_1019M_",
    "name": "RAL 1019 M",
    "hex": "#A4957D",
    "title": "Серо-бежевый матовый",
    "rate": 1.1
  },
  {
    "id": "_1035_",
    "name": "RAL 1035",
    "hex": "#A29985",
    "title": "Жемчужно-бежевый",
    "rate": 1.1
  },
  {
    "id": "_7048_",
    "name": "RAL 7048",
    "hex": "#888175",
    "title": "Перламутровый мышино-серый",
    "rate": 1.1
  },
  {
    "id": "_4005_",
    "name": "RAL 4005",
    "hex": "#83639D",
    "title": "Сине-сиреневый",
    "rate": 1.1
  },
  {
    "id": "_5017_",
    "name": "RAL 5017",
    "hex": "#0E518D",
    "title": "Транспортный синий",
    "rate": 1.1
  },
  {
    "id": "_5020_",
    "name": "RAL 5020",
    "hex": "#0B4151",
    "title": "Океанская синь",
    "rate": 1.1
  },
  {
    "id": "_6034_",
    "name": "RAL 6034",
    "hex": "#7FB0B2",
    "title": "Пастельный бирюзовый",
    "rate": 1.1
  },
  {
    "id": "_1016M_",
    "name": "RAL 1016 M",
    "hex": "#EAF044",
    "title": "Желтая сера матовый",
    "rate": 1.1
  },
  {
    "id": "_2010_",
    "name": "RAL 2010",
    "hex": "#D4652F",
    "title": "Сигнальный оранжевый",
    "rate": 1.1
  },
  {
    "id": "1М183SR127",
    "name": "1М183SR127",
    "hex": "_",
    "title": "Муар красный металлик",
    "rate": 1.1
  },
  {
    "id": "1T104S9016",
    "name": "1T104S9016",
    "hex": "_",
    "title": "Белый муар",
    "rate": 1.1
  },
  {
    "id": "1M103SS181",
    "name": "1M103SS181",
    "hex": "_",
    "title": "Муар светло-бежевый",
    "rate": 1.1
  },
  {
    "id": "1T183S8025",
    "name": "1T183S8025",
    "hex": "_",
    "title": "Кофейный муар",
    "rate": 1.1
  },
  {
    "id": "1M503SN291",
    "name": "1M503SN291",
    "hex": "_",
    "title": "Муар бронзовый",
    "rate": 1.1
  },
  {
    "id": "1M103SG529",
    "name": "1M103SG529",
    "hex": "_",
    "title": "Муар серый светлый металлик",
    "rate": 1.1
  },
  {
    "id": "1M183SN026",
    "name": "1M183SN026",
    "hex": "_",
    "title": "Муар серый темный металлик",
    "rate": 1.1
  },
  {
    "id": "TP26X-M215249005",
    "name": "TP26X-M215249005",
    "hex": "_",
    "title": "Структурный шелк черный",
    "rate": 1.1
  },
  {
    "id": "1T103S9005",
    "name": "1T103S9005",
    "hex": "_",
    "title": "Черный матовый муар",
    "rate": 1.1
  },
  {
    "id": "WM-DARK",
    "name": "WM-DARK",
    "hex": "_",
    "title": "Оружейный металлик темный",
    "rate": 1.2
  },
  {
    "id": "WM-LIGHT",
    "name": "WM-LIGHT",
    "hex": "_",
    "title": "Оружейный металлик светлый",
    "rate": 1.2
  },
  {
    "id": "_1015_",
    "name": "RAL 1015",
    "hex": "#EADEBD",
    "title": "Светлая слоновая кость",
    "rate": 1.2
  },
  {
    "id": "_1036_",
    "name": "RAL 1036",
    "hex": "#927549",
    "title": "Жемчужно-золотой",
    "rate": 1.2
  },
  {
    "id": "_8017_",
    "name": "RAL 8017",
    "hex": "#44322D",
    "title": "Шоколадно-коричневый",
    "rate": 1.2
  },
  {
    "id": "RAL",
    "name": "RAL другой",
    "hex": "_",
    "title": "Другие цвета RAL",
    "rate": 1.3
  }
];

export const DEF_COLOR_RAL = COLORS_RAL[ 0 ];